; domain
(define (domain visitall-diagonal-5-dim)
  (:requirements :strips :typing)
  (:types pos - object)
  (:predicates
    (at-robot ?x0 ?x1 ?x2 ?x3 ?x4 - pos)
    (visited ?x0 ?x1 ?x2 ?x3 ?x4 - pos)
    (can-move ?p1 ?p2 - pos)
  )

  (:action move
    :parameters (?x0_from ?x1_from ?x2_from ?x3_from ?x4_from ?x0_to ?x1_to ?x2_to ?x3_to ?x4_to - pos)
    :precondition (and
      (at-robot ?x0_from ?x1_from ?x2_from ?x3_from ?x4_from)
      (can-move ?x0_from ?x0_to)
      (can-move ?x1_from ?x1_to)
      (can-move ?x2_from ?x2_to)
      (can-move ?x3_from ?x3_to)
      (can-move ?x4_from ?x4_to)
    )
    :effect (and
      (at-robot ?x0_to ?x1_to ?x2_to ?x3_to ?x4_to)
      (visited ?x0_to ?x1_to ?x2_to ?x3_to ?x4_to)
      (not (at-robot ?x0_from ?x1_from ?x2_from ?x3_from ?x4_from))
    )
  )
)

; problem
;; dimension=5, side=15, chebyshev_distance=3.4000000000000004, num_goals=2, out_folder=./5dim/training, seed=49, instance_id=7
;; (0, 0, 2, 0, 2)
;; (0, 1, 0, 2, 1)

(define (problem visitall-diagonal-5-dim-07)
  (:domain visitall-diagonal-5-dim)
  (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - pos)
  (:init
    (at-robot p0 p0 p0 p0 p0)
    (visited p0 p0 p0 p0 p0)
    (can-move p0 p1)
    (can-move p1 p2)
    (can-move p2 p3)
    (can-move p3 p4)
    (can-move p4 p5)
    (can-move p5 p6)
    (can-move p6 p7)
    (can-move p7 p8)
    (can-move p8 p9)
    (can-move p9 p10)
    (can-move p10 p11)
    (can-move p11 p12)
    (can-move p12 p13)
    (can-move p13 p14)
    (can-move p1 p0)
    (can-move p2 p1)
    (can-move p3 p2)
    (can-move p4 p3)
    (can-move p5 p4)
    (can-move p6 p5)
    (can-move p7 p6)
    (can-move p8 p7)
    (can-move p9 p8)
    (can-move p10 p9)
    (can-move p11 p10)
    (can-move p12 p11)
    (can-move p13 p12)
    (can-move p14 p13)
    (can-move p0 p0)
    (can-move p1 p1)
    (can-move p2 p2)
    (can-move p3 p3)
    (can-move p4 p4)
    (can-move p5 p5)
    (can-move p6 p6)
    (can-move p7 p7)
    (can-move p8 p8)
    (can-move p9 p9)
    (can-move p10 p10)
    (can-move p11 p11)
    (can-move p12 p12)
    (can-move p13 p13)
    (can-move p14 p14)
  )
  (:goal (and
    (visited p0 p0 p2 p0 p2)
    (visited p0 p1 p0 p2 p1)
  ))
)

; plan
1. (move p0 p0 p0 p0 p0 p0 p0 p1 p0 p1)
   deleted: (at-robot p0 p0 p0 p0 p0)
   added: (at-robot p0 p0 p1 p0 p1) (visited p0 p0 p1 p0 p1)
   goals met: 0 of 2
2. (move p0 p0 p1 p0 p1 p0 p0 p2 p0 p2)
   deleted: (at-robot p0 p0 p1 p0 p1)
   added: (at-robot p0 p0 p2 p0 p2) (visited p0 p0 p2 p0 p2)
   goals met: 1 of 2
3. (move p0 p0 p2 p0 p2 p0 p1 p1 p1 p1)
   deleted: (at-robot p0 p0 p2 p0 p2)
   added: (at-robot p0 p1 p1 p1 p1) (visited p0 p1 p1 p1 p1)
   goals met: 1 of 2
4. (move p0 p1 p1 p1 p1 p0 p1 p0 p2 p1)
   deleted: (at-robot p0 p1 p1 p1 p1)
   added: (at-robot p0 p1 p0 p2 p1) (visited p0 p1 p0 p2 p1)
   goals met: 2 of 2
